УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиЗарплатаКадры/НастройкиЗарплатаКадры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗарплатаКадры</name>
  <resources>
    <name>ПрименятьСевернуюНадбавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьРайонныйКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьСевернуюНадбавкуВПодразделениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьРайонныйКоэффициентВПодразделениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьФормироватьПроводкиВКонцеПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользуетсяТрудФармацевтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользуетсяТрудЧленовЛетныхЭкипажей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользуетсяТрудЧленовЭкипажейМорскихСудов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользуетсяТрудШахтеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиЗарплатаКадры/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Организации = Новый Массив;
	Для Каждого Строка Из ЭтотОбъект Цикл
		Организации.Добавить(Строка.Организация);
	КонецЦикла;
	ЕстьОбособленныеОрганизаций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Организации, "ЕстьОбособленныеПодразделения");
	Для Каждого Строка Из ЭтотОбъект Цикл
		Строка.ПрименятьРайонныйКоэффициентВПодразделениях = Строка.ПрименятьРайонныйКоэффициент И ЕстьОбособленныеОрганизаций[Строка.Организация];
		Строка.ПрименятьСевернуюНадбавкуВПодразделениях = Строка.ПрименятьСевернуюНадбавку И ЕстьОбособленныеОрганизаций[Строка.Организация];
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
